bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
static unsigned int rx_counter;
static inline err_t bl702ethernetif_input(struct netif *netif)
{
    err_t err = ERR_OK;
    struct pbuf *p;
    EMAC_BD_Desc_Type *bd;

    /* move received packet into a new pbuf */
    do {
        p = low_level_input(netif);
        bd = &thiz->bd[thiz->rxIndexCPU];

        rx_counter++;
        /* no packet could be read, silently ignore this */
        if (p == NULL) return ERR_MEM;

        /* entry point to the LwIP stack */
        err = netif->input(p, netif);

        if (err != ERR_OK)
        {
            LWIP_DEBUGF(NETIF_DEBUG, ("ethernetif_input: IP input error\n"));
            printf("ethernetif_input: IP input error\n");
            pbuf_free(p);
        }
    } while (!(bd->C_S_L & EMAC_BD_FIELD_MSK(RX_E)));
    return err;
}

/* recv a pkt */
void EMAC_RX_Done_Callback(void)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if (NULL == DequeueTaskHandle) {
        return;
    }
    xTaskNotifyFromISR(DequeueTaskHandle, 0x02, eSetBits, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

void EMAC_RX_Error_Callback(void)
{
    MSG("Rx error\r\n");
}
void EMAC_RX_Busy_Callback(void)
{
    MSG("RX busy %u\r\n", rx_counter);
}

void emac_irq_process(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(EMAC_BASE,EMAC_INT_MASK);

    if (SET == emac_getintstatus(EMAC_INT_TX_DONE) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_TXB_M)) {
        //printf("EMAC_INT_TX_DONE\r\n");
        emac_clrintstatus(EMAC_INT_TX_DONE);
        emac_intmask(EMAC_INT_TX_DONE, MASK);
        EMAC_TX_Done_Callback();
    }

    if (SET == emac_getintstatus(EMAC_INT_TX_ERROR) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_TXE_M)) {
        //printf("EMAC_INT_TX_ERROR\r\n");
        emac_clrintstatus(EMAC_INT_TX_ERROR);
        EMAC_TX_Error_Callback();
    }

    if (SET == emac_getintstatus(EMAC_INT_RX_DONE) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_RXB_M)) {
        //printf("EMAC_INT_RX_DONE\r\n");
        emac_clrintstatus(EMAC_INT_RX_DONE);
        emac_intmask(EMAC_INT_RX_DONE, MASK);
        EMAC_RX_Done_Callback();
    }

    if (SET == emac_getintstatus(EMAC_INT_RX_ERROR) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_RXE_M)) {
        //printf("EMAC_INT_RX_ERROR\r\n");
        emac_clrintstatus(EMAC_INT_RX_ERROR);
        EMAC_RX_Error_Callback();
    }

    if (SET == emac_getintstatus(EMAC_INT_RX_BUSY) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_BUSY_M)) {
        //printf("EMAC_INT_RX_BUSY\r\n");
        emac_clrintstatus(EMAC_INT_RX_BUSY);
        EMAC_RX_Busy_Callback();
    }

    if (SET == emac_getintstatus(EMAC_INT_TX_CTRL) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_TXC_M)) {
        //printf("EMAC_INT_TX_CTRL\r\n");
        emac_clrintstatus(EMAC_INT_TX_CTRL);
    }

    if (SET == emac_getintstatus(EMAC_INT_RX_CTRL) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_RXC_M)) {
        //printf("EMAC_INT_RX_CTRL\r\n");
        emac_clrintstatus(EMAC_INT_RX_CTRL);
    }
}

void EMAC_Interrupt_Init(void)
{
    log_info("EMAC_Interrupt_Init.\r\n");
    bl_irq_register(EMAC_IRQn, emac_irq_process);
    bl_irq_enable(EMAC_IRQn);

    emac_clrintstatus(EMAC_INT_ALL);
    emac_intmask(EMAC_INT_ALL, UNMASK);
    log_info("emac_intmask.\r\n");
}

//FIXME ugly extern functions
int emac_phy_reset(void);
int emac_phy_linkup(ETHPHY_CFG_Type *cfg);
int emac_phy_autonegotiate(ETHPHY_CFG_Type *cfg);

#if 0
static int _emac_phy_reset(ETHPHY_CFG_Type *cfg)
{
    uint32_t tmpVal;

    /* Set Phy Address */
    tmpVal=BL_RD_REG(EMAC_BASE, EMAC_MIIADDRESS);
    tmpVal=BL_SET_REG_BITS_VAL(tmpVal,EMAC_FIAD,cfg->phyAddress);
    BL_WR_REG(EMAC_BASE, EMAC_MIIADDRESS,tmpVal);

    if (SUCCESS != emac_phy_reset()) {
        return ERROR;
    }
    return SUCCESS;
}
#endif

static int _emac_phy_autonegotiation(ETHPHY_CFG_Type *cfg)
{
    uint16_t phyReg;

    if(cfg->autoNegotiation){
        uint16_t regval = 0;
        uint16_t advertise = 0;
        uint16_t lpa = 0;
        uint32_t timeout = 0x3F0;

        if (SUCCESS != emac_phy_read(PHY_PHYID1, &regval)) {
            return ERROR;
        }

        if (SUCCESS != emac_phy_read(PHY_PHYID2, &regval)) {
            return ERROR;
        }

        if (SUCCESS != emac_phy_read(PHY_BCR, &regval)) {
            return ERROR;
        }

        regval &= ~PHY_AUTONEGOTIATION;
        regval &= ~(PHY_LOOPBACK | PHY_POWERDOWN);
        regval |= PHY_ISOLATE;
        if(emac_phy_write(PHY_BCR, regval) != SUCCESS){
            return ERROR;
        }

        /* set advertisement mode */
        advertise = PHY_ADVERTISE_100BASETXFULL | PHY_ADVERTISE_100BASETXHALF |
                 PHY_ADVERTISE_10BASETXFULL | PHY_ADVERTISE_10BASETXHALF |
                 PHY_ADVERTISE_8023;
        if(emac_phy_write(PHY_ADVERTISE, advertise) != SUCCESS){
            return ERROR;
        }

        BL702_Delay_MS(16);
        if (SUCCESS != emac_phy_read(PHY_BCR, &regval)) {
            return ERROR;
        }

        BL702_Delay_MS(16);
        regval |= (PHY_FULLDUPLEX_100M | PHY_AUTONEGOTIATION);
        if(emac_phy_write(PHY_BCR, regval) != SUCCESS){
            return ERROR;
        }

        BL702_Delay_MS(16);
        regval |= PHY_RESTART_AUTONEGOTIATION;
        regval &= ~PHY_ISOLATE;
        if(emac_phy_write(PHY_BCR, regval) != SUCCESS){
            return ERROR;
        }

        //BL702_Delay_MS(2000);
        while(1) {
            if (SUCCESS != emac_phy_read(PHY_BSR, &regval)) {
                return ERROR;
            }

            if (regval & PHY_AUTONEGO_COMPLETE) {
                /* complete */
                break;
            }

            if (!(--timeout)) {
                printf("%s:%d\r\n", __func__, __LINE__);
                return TIMEOUT;
            }
        }

        //BL702_Delay_MS(5000);
        if (SUCCESS != emac_phy_read(PHY_LPA, &lpa)) {
            printf("%s:%d\r\n", __func__, __LINE__);
            return ERROR;
        }

        if (((advertise & lpa) & PHY_ADVERTISE_100BASETXFULL) != 0)
        {
            /* 100BaseTX and Full Duplex */
            cfg->duplex = EMAC_MODE_FULLDUPLEX;
            cfg->speed = EMAC_SPEED_100M;
        }
        else if (((advertise & lpa) & PHY_ADVERTISE_10BASETXFULL) != 0)
        {
            /* 10BaseT and Full Duplex */
            cfg->duplex = EMAC_MODE_FULLDUPLEX;
            cfg->speed = EMAC_SPEED_10M;
        }
        else if (((advertise & lpa) & PHY_ADVERTISE_100BASETXHALF) != 0)
        {
            /* 100BaseTX and half Duplex */
            cfg->duplex = EMAC_MODE_HALFDUPLEX;
            cfg->speed = EMAC_SPEED_100M;
        }
        else if (((advertise & lpa) & PHY_ADVERTISE_10BASETXHALF) != 0)
        {
            /* 10BaseT and half Duplex */
            cfg->duplex = EMAC_MODE_HALFDUPLEX;
            cfg->speed = EMAC_SPEED_10M;
        }
        return SUCCESS;
    }else{
        if(emac_phy_read(PHY_BCR, &phyReg) != SUCCESS){
            return ERROR;
        }
        phyReg&=(~PHY_FULLDUPLEX_100M);
        if(cfg->speed == EMAC_SPEED_10M){
            if(cfg->duplex==EMAC_MODE_FULLDUPLEX){
                phyReg|=PHY_FULLDUPLEX_10M;
            }else{
                phyReg|=PHY_HALFDUPLEX_10M;
            }
        }else{
            if(cfg->duplex==EMAC_MODE_FULLDUPLEX){
                phyReg|=PHY_FULLDUPLEX_100M;
            }else{
                phyReg|=PHY_HALFDUPLEX_100M;
            }
        }
        if((emac_phy_write(PHY_BCR, phyReg)) != SUCCESS){
            return ERROR;
        }
    }
    return SUCCESS;
}

