bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
static int _emac_phy_setNegotiationConfig(ETHPHY_CFG_Type *cfg)
{
    uint32_t tmpVal;

    /* Set MAC duplex config */
    tmpVal=BL_RD_REG(EMAC_BASE, EMAC_MODE);
    tmpVal=BL_SET_REG_BITS_VAL(tmpVal,EMAC_FULLD,cfg->duplex);
    BL_WR_REG(EMAC_BASE, EMAC_MODE,tmpVal);

    return SUCCESS;
}

static int _emac_phy_linkup(ETHPHY_CFG_Type *cfg)
{
    emac_phy_linkup(cfg);

    return SUCCESS;
}

static int _emac_phy_linkstatus(void)
{
    uint16_t phy_bsr = 0;

    //MSG("Read link\r\n");
    if (SUCCESS != emac_phy_read(PHY_BSR, &phy_bsr)) {
        printf("%s:%d\r\n", __func__, __LINE__);
        return ERROR;
    }

    if (!(PHY_LINKED_STATUS & phy_bsr)) {
        printf("%s:%d\r\n", __func__, __LINE__);
        return ERROR;
    }


    return SUCCESS;
}

static void _emac_phy_if_init(void)
{
#define EMAC_PHY_INIT_STEP_RESET                (0)
#define EMAC_PHY_INIT_STEP_NEGOTIATION          (1)
#define EMAC_PHY_INIT_STEP_CONFIG               (2)
#define EMAC_PHY_INIT_STEP_LINKUP               (3)
#define EMAC_PHY_INIT_STEP_SERCIVE_START        (4)
#define EMAC_PHY_INIT_STEP_LINKMAINTAIN         (5)
    static int internal_status = 0;

    int err = SUCCESS;
	static ETHPHY_CFG_Type phyCfg={
		.autoNegotiation=ENABLE,                    /*!< Speed and mode auto negotiation */
		.duplex=EMAC_MODE_FULLDUPLEX,             /*!< Duplex mode */
		.speed=EMAC_SPEED_100M,                   /*!< Speed mode */
		.phyAddress=0x1,                            /*!< PHY address */
	};

    //log_info("_emac_phy_if_init.\r\n");
    switch (internal_status) {
        case EMAC_PHY_INIT_STEP_RESET:
        {
            log_info("EMAC_PHY_INIT_STEP_RESET.\r\n");
            {
#if 0
                bl_gpio_enable_output(9, 1, 0);
                aos_msleep(10);
                bl_gpio_output_set(9, 0);
                aos_msleep(10);
                bl_gpio_output_set(9, 1);
                aos_msleep(10);
#endif
            }
            err = emac_phyinit(&phyCfg);
            if(err != SUCCESS)
            {
                log_info("emac_phyinit init err[%d].\r\n", err);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_NEGOTIATION:
        {
            log_info("EMAC_PHY_INIT_STEP_NEGOTIATION.\r\n");
            err = _emac_phy_autonegotiation(&phyCfg);
            if(err != SUCCESS)
            {
                log_info("EMAC_PHY_INIT_STEP_NEGOTIATION err[%d].\r\n", err);
                return;
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_CONFIG:
        {
            log_info("EMAC_PHY_INIT_STEP_CONFIG.\r\n");
            err = _emac_phy_setNegotiationConfig(&phyCfg);
            if(err != SUCCESS){
                log_info("EMAC_PHY_INIT_STEP_CONFIG err[%d].\r\n", err);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_LINKUP:
        {
            log_info("EMAC_PHY_INIT_STEP_LINKUP.\r\n");
            err = _emac_phy_linkup(&phyCfg);
            log_info("speed %d\r\n", phyCfg.speed);
            if(TIMEOUT==err){
                MSG("PHY Init timeout\r\n");
                while(1);
            }
            if(ERROR==err){
                MSG("PHY Init error\r\n");
                while(1);
            }
            if(phyCfg.duplex==EMAC_MODE_FULLDUPLEX){
                MSG("EMAC_MODE_FULLDUPLEX\r\n");
            }else{
                MSG("EMAC_MODE_HALFDUPLEX\r\n");
            }
            if(phyCfg.speed==EMAC_SPEED_100M){
                MSG("EMAC_SPEED_100M\r\n");
            }else{
                MSG("EMAC_SPEED_50M\r\n");
            }
            MSG("PHY Init done\r\n");
            if(p_eth_callback){
                p_eth_callback(ETH_INIT_STEP_LINKUP);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_SERCIVE_START:
        {
            log_info("EMAC_PHY_INIT_STEP_SERCIVE_START start dhcp...\r\n");
            if(p_eth_callback){
                p_eth_callback(ETH_INIT_STEP_READY);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_LINKMAINTAIN:
        {
            //log_info("EMAC_PHY_INIT_STEP_LINKMAINTAIN.\r\n");
            _emac_phy_linkstatus();
        }
        break;
        default:
        {
            log_info("emac unkonwn internal status\r\n");
        }
    }
}

void borad_eth_init(uint8_t*addr)
{
    EMAC_CFG_Type emacCfg={
        .recvSmallFrame=ENABLE,                     /*!< Receive small frmae or not */
        .recvHugeFrame=DISABLE,                     /*!< Receive huge frmae(>64K bytes) or not */
        .padEnable=ENABLE,                          /*!< Enable padding for frame which is less than MINFL or not */
        .crcEnable=ENABLE,                          /*!< Enable hardware CRC or not */
        .noPreamble=DISABLE,                        /*!< Enable preamble or not */
        .recvBroadCast=ENABLE,                      /*!< Receive broadcast frame or not */
        .interFrameGapCheck=ENABLE,                 /*!< Check inter frame gap or not */
        .miiNoPreamble=ENABLE,                      /*!< Enable MII interface preamble or not */
        .miiClkDiv=49,                              /*!< MII interface clock divider from bus clock */
        .maxTxRetry=16,                             /*!< Maximum tx retry count */
        .interFrameGapValue=24,                     /*!< Inter frame gap vaule in clock cycles(default 24)*/
        .minFrameLen=64,                            /*!< Minimum frame length */
        .maxFrameLen=ETH_MAX_BUFFER_SIZE,           /*!< Maximum frame length */
        .collisionValid=16,                         /*!< Collision valid value */
    };

    memcpy(emacCfg.macAddr, addr, sizeof(emacCfg.macAddr));
    EMAC_GPIO_Init();

#if USER_EMAC_OUTSIDE_CLK  // use outside clk
    GLB_Set_ETH_REF_O_CLK_Sel(GLB_ETH_REF_CLK_OUT_OUTSIDE_50M);
#else  // use inside clk
    //enable audio clock for emac */
    PDS_Enable_PLL_Clk(PDS_PLL_CLK_48M);
    PDS_Set_Audio_PLL_Freq(AUDIO_PLL_50000000_HZ);
    GLB_Set_ETH_REF_O_CLK_Sel(GLB_ETH_REF_CLK_OUT_INSIDE_50M);
#endif

    GLB_AHB_Slave1_Clock_Gate(0,BL_AHB_SLAVE1_EMAC);
	EMAC_Interrupt_Init();
    emac_init(&emacCfg);
    MSG("emac_init sucess\r\n");
    EMAC_BD_Init();
    emac_enable();
    //bflb_platform_init_time();
    //bflb_platform_start_time();
}

void eth_get_mac(uint8_t mac[6]) 
{
    uint8_t addr[8];

    extern int bl_wireless_mac_addr_get(uint8_t mac[8]);
    bl_wireless_mac_addr_get(addr);
    if (addr[0] == 0) {
        mac[0] = 0x18;
        mac[1] = 0xB0;
        mac[2] = 0x09;
        mac[3] = addr[5];
        mac[4] = addr[6];
        mac[5] = addr[7];
    }
    else {
        mac[0] = addr[0];
        mac[1] = addr[1];
        mac[2] = addr[2];
        mac[3] = addr[5];
        mac[4] = addr[6];
        mac[5] = addr[7];
    }
}

/**
 * In this function, the hardware should be initialized.
 * Called from ethernetif_init().
 *
 * @param netif the already initialized lwip network interface structure
 *        for this ethernetif
 */

static void low_level_init(struct netif *netif)
{
    netif->hwaddr_len = ETHARP_HWADDR_LEN;
    netif->mtu = 1500;
    netif->flags = NETIF_FLAG_BROADCAST|NETIF_FLAG_ETHARP|NETIF_FLAG_LINK_UP|NETIF_FLAG_IGMP;
    eth_get_mac(netif->hwaddr);

    printf("low level init\r\n");

