bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
#if LWIP_IPV6
      netif->flags |= (NETIF_FLAG_ETHERNET | NETIF_FLAG_IGMP | NETIF_FLAG_MLD6);
      netif->output_ip6 = ethip6_output;
#endif
}

static inline void bl702ethernetif_output(struct netif *netif)
{
    struct unsent_item *item;
    struct pbuf *q, *p;
    EMAC_BD_Desc_Type *bd;
    int wrap_found, offset;

    bd = &thiz->bd[thiz->txIndexCPU];
    while (0 == (bd->C_S_L & EMAC_BD_FIELD_MSK(TX_RD)) && ctx->unsent_num) {

        __disable_irq();
        item = (struct unsent_item *)utils_list_pop_front(&ctx->unsent);
        ctx->unsent_num--;
        __enable_irq();

        p = item->p;
        p->len -= PBUF_LINK_ENCAPSULATION_HLEN;
        p->tot_len -= PBUF_LINK_ENCAPSULATION_HLEN;
        p->payload += PBUF_LINK_ENCAPSULATION_HLEN;

        if ((++thiz->txIndexCPU) > thiz->txBuffLimit) {
            /* wrap back */
            thiz->txIndexCPU = 0;
            wrap_found = 1;
        } else {
            wrap_found = 0;
        }

        offset = 0;
        for (q = p; q != NULL; q = q->next) {
            memcpy((uint8_t *)bd->Buffer + offset, (uint8_t*)q->payload, q->len);
            offset += q->len;
        }
        pbuf_free(p);

        bd->C_S_L = (wrap_found ? EMAC_BD_FIELD_MSK(TX_WR) : 0) | EMAC_TX_COMMON_FLAGS | p->tot_len << BD_TX_LEN_POS;
        bd = &thiz->bd[thiz->txIndexCPU];
    }
}

void unsent_recv_task(void *pvParameters)
{
    uint32_t NotifyValue;
    BaseType_t recv;
    struct netif *netif = (struct netif *)pvParameters;

    borad_eth_init(netif->hwaddr);

    log_info("unsent_recv_task.\r\n");
    while(1) {
        NotifyValue = 0;
        recv = xTaskNotifyWait(0, ULONG_MAX, &NotifyValue, 200);
        if (recv == pdTRUE) {
            if (NotifyValue & (1 << 0)) {
                bl702ethernetif_output(netif);
                emac_intmask(EMAC_INT_TX_DONE, UNMASK);
            }
            if (NotifyValue & (1 << 1)) {
                bl702ethernetif_input(netif);
                emac_intmask(EMAC_INT_RX_DONE, UNMASK);
            }
        } else {
            /*XXX only work when we has no EVENT. Maybe buggy here??*/
            _emac_phy_if_init();
        }
    }
}

static err_t low_level_output(struct netif *netif, struct pbuf *p)
{
    struct unsent_item *item;

    if (pbuf_header(p, PBUF_LINK_ENCAPSULATION_HLEN)) {
        printf("[TX] Reserve room failed for header\r\n");
        return ERR_IF;
    }
    item = (struct unsent_item *)(((uintptr_t)(p->payload + 3))&(~3));
    item->p = p;

    pbuf_ref(p);

    if (NULL == DequeueTaskHandle) {
        return ERR_IF;
    } 
    __disable_irq();
    utils_list_push_back(&ctx->unsent, (struct utils_list_hdr *)&(item->hdr));
    ctx->unsent_num++;
    __enable_irq();
    xTaskNotify(DequeueTaskHandle, 0x01, eSetBits);

    return ERR_OK;
}

err_t eth_init(struct netif *netif)
{
    LWIP_ASSERT("netif != NULL", (netif != NULL));
    
    netif->name[0] = 'e';
    netif->name[1] = 't';
    netif->hostname = "702";
    netif->output = etharp_output;
    netif->linkoutput = low_level_output;
    log_info("eth_init.\r\n");
    low_level_init(netif);
    xTaskCreate(unsent_recv_task, (const char *)"Ontput_Unsent_queue", 1024, netif, 29, &DequeueTaskHandle);

    return ERR_OK;
}

int ethernet_init(eth_callback cb)
{
    p_eth_callback = cb;
    return 0;
}

